using System;

namespace СоцСеть {
    class Program {
	static void Main(string[] args) {
	    // Пользователь п1 = new Пользователь("user1");
	    // Пользователь п2 = new Пользователь("user2");
	    // Сообщение с1 = new Сообщение(п1);
	    // Сообщение с2 = new Сообщение(п2);
	    // с1.ЗадатьТекст("текст 1");
	    // с2.ЗадатьТекст("текст 2");
	    // Чат ч = new Чат(п1, п2);
	    // ч.ДобавитьСообщение(с1);
	    // ч.ДобавитьСообщение(с2);
	    // foreach (Сообщение с in ч.ПолучитьСообщения()) {
	    // 	Console.Write(с.ПолучитьПользователя().ПолучитьИмя() + ": ");
	    // 	Console.WriteLine(с.ПолучитьТекст());
		Console.WriteLine("TEST");
	    // }
	}
    }
}
